app/controllers/comments_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("author", "created_at", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["author", "Daniel"], ["created_at", Tue, 17 Sep 2013 21:48:39 UTC +00:00], ["message", "Hello there!"], ["updated_at", Tue, 17 Sep 2013 21:48:39 UTC +00:00], ["user_id", 1]]
---
	def create
    	@user = User.find(params[:user_id])
    	@comment = @user.comments.create(params[:comment])