app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "encrypted_password", "first_name", "last_name", "password_confirmation", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = 1 ORDER BY id ASC
---
  def show
  	@user = User.find(params[:id])
    @comments = User.find(params[:id]).comments.order("id ASC")